docs/Technologies/Database.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-11-04 Thu 16:57 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Databases</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="/static/css/org.css">
</head>
<body>
<div id="preamble" class="status">
<a href="/">Home</a>
</div>
<div id="content">
<header>
<h1 class="title">Databases</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org520b315">1. Links</a></li>
<li><a href="#orgd2f2d0e">2. Projects</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org520b315" class="outline-2">
<h2 id="org520b315"><span class="section-number-2">1</span> Links</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="https://github.com/scottrogowski/mongita">Mongita</a></li>
<li><a href="https://mtlynch.io/litestream/">How Litestream Eliminated My Database Server for $0.03/month</a></li>
<li><a href="http://eradman.com/ephemeralpg/">pg<sub>tmp</sub>(1)</a></li>
<li><a href="https://github.com/krotik/eliasdb">eliasDB</a></li>
<li><a href="https://nakabonne.dev/posts/write-tsdb-from-scratch/">Time Series Database from Scratch</a></li>
<li><a href="https://docs.janusgraph.org/">JanusGraph</a></li>
<li><a href="https://arxiv.org/abs/1508.03843">Gremlin Graph Traversal Machine and Language</a></li>
<li><a href="https://relistan.com/coordination-free-db-query-chunking">Coordination-free Database Query Sharding with Postgres</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd2f2d0e" class="outline-2">
<h2 id="orgd2f2d0e"><span class="section-number-2">2</span> Projects</h2>
<div class="outline-text-2" id="text-2">
<p>
Consider writing databases as some interesting projects. Working currently on a "Redis-like" db but maybe consider SQL type or Document DB
</p>

<ul class="org-ul">
<li><a href="https://github.com/auxten/go-sqldb">Go-SQLDB</a></li>
<li><a href="https://cstack.github.io/db_tutorial/">Let's build a simple database</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-11-04 Thu 16:57</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
